{"meta":{"title":"Edo","subtitle":"Ensemble renversons la tendance!","description":"La connaissance contrairement est l'une des rares choses que nous pouvons partager sans que la quantite que nous avons ne diminue. Je passe par ce blog pour partager mes experiences et le peu de connaissance que j\\'ai acquis. J\\'ai la ferme conviction qu\\'en partagant la connaissance que nous acquerons nous en acquerons encore plus.","author":"blackgerman","url":"http://blackgerman.github.io"},"pages":[{"title":"","date":"2017-01-14T21:06:02.000Z","updated":"2017-01-14T21:06:02.000Z","comments":true,"path":"about/index.html","permalink":"http://blackgerman.github.io/about/index.html","excerpt":"","text":""}],"posts":[{"title":"Change! (变化)","slug":"Change","date":"2016-12-29T11:42:19.000Z","updated":"2017-03-06T21:45:17.000Z","comments":true,"path":"2016/12/29/Change/","link":"","permalink":"http://blackgerman.github.io/2016/12/29/Change/","excerpt":"","text":"要想成大事却完全靠别人的帮助，那么你必然会失败！ 这句话其实就是说如果你要完成一个目标，但自己却不认真，没有一个十分投入的状态的话，那么无论别人怎么逼你，你也不可能实现，永远不可能成功。 在这个世界上，只要是有想象力，有梦想的人，都曾经想过，去突破自己的极限。大部分的人，无论男女老少，肯定都想改变自己的生活，改变家人的生活，往一个好的方向去发展。于是大家都知道要想实现这个梦想，最好是选择创业这条路。 既然社会已经给了我们每一个人相对比较平等的创业机会，那为什么最终还是会有不同的结果？其实这个问题，我觉得不仅仅是跟创业本身有关，同时也是大家在生活中成功与否的原因之一。 今天就想得到回报。 比如说今天做事，今天就想拿到钱。其实这个心态才是一个导致人失败的最大的问题。 举例子： 比如你是一个程序员，你接了别人的单之后，价格都谈好了，所有细节都谈好了。后来，商家又多提了一个比较简单的要求，你就想要商家加钱了。双方都知道这个要求很容易做到，但是你非要他多出钱。 这种心态只会引起商家的反感，让他失去了和你合作的欲望，而且最终他很可能再也不会让你接他的单子了。 你要想在生意上获得比别人更大的成就，就要比别人多付出一点。 比如别人卖某个东西，却总是在客户面前一副苦脸。而有个人卖的东西和你完全一样，但是跟他的客户每一次聊天都很友好，并且一直在持续的维护关系。这可能对大家来说只是个简单的事情，但就是这么一个简单的习惯，能给他带来长期的交易，让他获得更大的成就。 自己不愿意吃苦的话，总会被苦难所淘汰。 还有些人总是在找捷径，不愿意吃苦。那么一旦遇到了挫折，必然就会失败。你最终的表现是否优秀，是由你目前的一个心理准备是否充分而决定。如果你没有做好吃苦的心理准备，那么，你就基本上不可能成功。 在此，我想总结一句话：当你想要成就大业的时候，你必须知道前面会有挫折，障碍。不过，正是这些磨难，痛苦才成就了你。 – 伍乐","categories":[{"name":"Toughts","slug":"Toughts","permalink":"http://blackgerman.github.io/categories/Toughts/"}],"tags":[{"name":"Toughts, Chinese, 汉语","slug":"Toughts-Chinese-汉语","permalink":"http://blackgerman.github.io/tags/Toughts-Chinese-汉语/"}]},{"title":"Github","slug":"Github","date":"2016-12-12T02:38:39.000Z","updated":"2017-03-06T22:31:36.000Z","comments":true,"path":"2016/12/12/Github/","link":"","permalink":"http://blackgerman.github.io/2016/12/12/Github/","excerpt":"","text":"GitHub Les tendances de codage ont beaucoup changer au cours du temps. Au debut de l’ère du codage, la roue avait besoin d’être inventée c’est à dire que lorsqu’une application etait developpée, la plus part des librairies et du code pour y parvenir avait besoin d’être écris depuis le début. Pourtant a l’heure actuelle ou je suis entrain d’écrire, beaucoup de librairies et d’outils ont dejà etées créer par d’autre codeurs autour du monde. Le challenge aujourd’hui dans beaucoup de cas (pas tous), n’est alors que d’arriver à comprendre et à utiliser ce que d’autre personnes ont dejà coder et ont mis a la disposition d’autres codeur sous la forme d’open source. Github est la plus grande plateforme aujourd’hui hebergant de l’ open source code. Github est une plateforme gratuite qui octroie a toute personne tierse enregistrée sur sa plateforme d’uploader du code, et de le tenir a jour au fil du temps en permettant des actualisations, des uploads à chaque fois qu’une modification vous semble importante. Par exemple, imaginez qu’avec des amis à travers le monde, vous vous donner pour objectif de créer un site web. Du fait de vos distantes locations, il est difficile pour le groupe de travailler ensemble travailler ensemble. Pour pâlier un tant soit peu à ce problème, Vous pouvez utiliser un serveur git pour cela (ou github si la publication du code source de votre site web ne vous derange pas). Cela vous permettra a chacun d’avoir une version toujours à jour du code et cela même si vous amis font des changements pêle et mêle, vous pourrez toujours avoir une version très a jour du code globale ( celui de vos amis + le votre pour vous aidez a evoluer tous ensemble. Et en plus de tout cela, vous pourrez même retourner dans l’historique des mises a jour pour recupérer une version antérieure de votre code (cette caractéristique est très importante lors de la résolution de bugs). L’objet de cet article est d’enseigner les bases de l’utilisation de github en ce qui concerne : L’installation de l’outils Git La création d’un dépôt de code (repository) github Comment uploader du code sur github. Prérequis git: Ceci est l’outils principale sur lequel se base github pour procurer de ses services. Il est télechargable sur le site suivant Git, mais au moment de l’installation, nous devons faire attention à installer Git aussi bien en console qu’en graphique: Selectionner les options Git Bash Here &amp; Git GUI Here pour que ces options puissent être ajoutées au menu explorer. Selectionner l’option du milieu pour que la commande git puisse être ajouter à la variable d’environement PATH de sorte que nous puissions utiliser git depuis le terminal (console). Sans plus tarder, je vais vous apprendre a créer un projet sur github, à l’uploader sur le serveur et à permettre a plusieurs partenaires de pouvoir le modifier en même temps que vous. Accrochez vous bien ! 8). Entrer dans le monde de githubPour se rendre sur github il suffit de se rendre a cette adresse ci http://github.com . Pour pour pouvoir accéder à la majorité des outils que cette platforme nous procure gratuitement , Nous avons besoin de créer un compte github. Cliquez ici pour créer votre compte github et entrez toutes les informations requises. Creer un depôt githubA cet endroit, une explication s’impose! Pourquoi créer un projet github ?Parce qu’en fait github, agit jusqu’ici comme une hebergeur de code source. C’est a dire que github peut nous permettre d’enregistrer le code source d’une certaine application, logiciel ou même d’un simple texte que nous sommes en train d’ecrire et de le sauvegarder en ligne de sorte à pouvoir accéder de multiples localitées. NB : comme je l’avais dit plutot github, est une plateforme qui fait uniquement dans le code source et à cause de celà a tous les droits d’effacer les fichiers musicaux ou videos, bref medias anormalement sauvegarder sur sa plateforme. Pour créer un nouveau projet , rendez vous sur la page d’acceuil de votre compte et :Appuyer sur le bouton nouveau projet. Entrer les informations du projet que vous voulez creer sur la page qui s’affichera a vous. Les informations comprennent : Owner : Celui a qui appartient de le projet Repository name : Le nom du projet Description : Une courte description de votre projet Ensuite vous devez choisir si vous voulez votre projet publique (acces ouvert a tout le monde), ou votre projet prive, c’est a dire que seulement vous et les personnes que vous aurez autoriser auront accès à voir ce projet. Le dernier point demande si vous aimeriez démarrer le projet actuel en créant un fichier README.md . Ce fichier permettra de procurer une page d’accueil de projet a quiconque voudra consulter votre projet sur github. Add .gitignore contient la liste de fichier que vous n’aimeriez inclure dans vos commit/push. Add a license demande quelle license paraine vous aimeriez rattacher a votre projet. Il existe plusieur types de license qui regissent les projets, les plus utilisées sont apache 2.0, MIT etc… Ce license definissent les conditions de reutilisation d’un certain code source par des tierses personnes. de votre code source à d’autre essient. Uploader sur GitHubPour importer du contenu sur github, vous devez dejà le posséder en local (sur votre ordinateur). I- Rendez vous dans le repertoire du contenu que vous compter importer. II- Faites un click droit dans le dossier et selectionner l’option Git Bash Here . Celà ouvrira pour vous un terminal git dans le dossier où vous vous trouvez actuellement.Une fois terminal ouvert, vous entrez la commande dir et validez. Vous verez s’afficher la liste des fichiers dans votre dossier de travail. La toute premiere fois où vous uploadez de votre dossier vers github, nous avons besoin d’effectuer certaines taches basiques: initialiser le dossier actuel si ceci n’est pas encore fait en entrant la commande ci dessous: 1git init faire le lien entre le dossier local et le depôt github en ligne: 1git remote add origin https://github.com/blackgerman/ubiquitous-disco.git Ce que nous devons savoir ici c’est que le dernier parametre, le lien pointe vers notre depôt en ligne. III. Voici les trois pas que vous devrez poser à chaque fois que voudrez importer votre code vers votre depôt github: Ajouter les fichiers que vous voulez ajouter a votre git. Par exemple pour un fichier mail.doc dans votre dossier, vous ferez : 1git add mail.doc Pour la plupart du temps, vous avez besoin de rajouter tous les dossiers au git ce qui se fait la commande qui stipule que tout le dossier sera pris en compte : 1git add . IV. Faire une sauveguarde de l’état actuel de votre projet, ce qui s’appelle faire un commit: 1git commit –m &quot;Message explicatif de la sauveguarde&quot; Le message explicatif de la sauvegarde nous permettra dans l’historique de sauvegarde de savoir quand et pourquoi est ce que des sauvegardes ont etées faites. La grande force du versionnage de code est qu’ a un niveau plus avancer, Nous pourrons même revenir a des états de sauvegarde anterieur de l’application à notre guise. V. Pour uploader le code source vers la plateforme, nous devons utiliser la commande: 1git push -u origin master push : stipule que vous voulez effectuer un upload vers la plateforme en ligne -u origin : stipule le depôt de code vers lequel l’upload est effectuer master : stipule la branche vers laquelle vous faites votre upload Si tout se passe bien apres cette commande il vous sera demander d’entrer les informations de votre compte (nom d’utilisateur et mot de passe github). A partir de votre deuxième mise a jour du code source en ligne, vous pourrez donc vous contenter d’utiliser ces commandes pour uploader des données vers votre depôt github.123git add .git commit –m &quot;Message explicatif de la sauveguarde&quot;git push Cela vous permettra d’uploader la branche actuelle sur laquelle vous vous trouvez vers github. NB : Cet article discute uniquement de l’utilisation de github si vous êtes seul à travailler sur github, et si vous n’uploadez votre code que d’une seule machine. Un autre article discutera de concepts plus complexes par rapport a l’utilisation de l’outils git en general.","categories":[{"name":"Technologies","slug":"Technologies","permalink":"http://blackgerman.github.io/categories/Technologies/"}],"tags":[{"name":"github","slug":"github","permalink":"http://blackgerman.github.io/tags/github/"}]},{"title":"Hello World","slug":"hello-world","date":"2016-12-11T13:47:45.000Z","updated":"2016-12-11T13:47:45.000Z","comments":true,"path":"2016/12/11/hello-world/","link":"","permalink":"http://blackgerman.github.io/2016/12/11/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}